---
kind: other
id: Properties.T:Autodesk.Revit.DB.Analysis.GenericZoneDomainData
source: html/0fa3bf35-e32e-2ebc-91a3-7e1c325ee564.htm
---
# GenericZoneDomainData Properties

Specifies whether the .NET object represents a valid Revit entity.